# 5.ระบบตรวจสินค้าซํา 
# ร้านสะดวกซื้อแห่งหนึ่งบันทึกรหัสสินค้าที่ลูกค้าหยิบ 
# ผู ้จัดการอยากรู ้ว่า 
# “มีสินค้ากี่รหัสที่ถูกหยิบมากกว่า 1 ครั ้ง” 
# หากสินค้ารหัสเดียวกันถูกหยิบ 10 ครั ้ง ให้นับเป็น “1 รหัส” 
# Input 
# บรรทัดแรก จํานวนสินค้า n 
# บรรทัดที่สอง รหัสสินค้า n ตัว 
# Output 
# จํานวนรหัสสินค้าที่ซํ้า 
# Example 
# Input 
# 8 
# 101 205 101 300 205 205 500 600 
 
# Output 
# 2 

from collections import Counter
x=int(input())
y = input().split()
c = Counter(y)
a = sum(1 for v in c.values() if v > 1)
print(a)