# # 1. ระบบคำนวณพลังงานรถไฟแม่เหล็ก

# รถไฟแม่เหล็กความเร็วสูงต้องใช้พลังงานในการวิ่งผ่านแต่ละสถานี

# หากสถานีใดมีค่าพลังงานเป็นลบ หมายถึงรถไฟเสียพลังงาน  
# หากเป็นบวก หมายถึงได้รับพลังงานเพิ่ม

# วิศวกรต้องการรู้ว่า

# “ช่วงไหนของการเดินทางที่ทำให้รถไฟมีพลังงานรวมมากที่สุด”
# Maximum Subarray Sum || Kadane's Algorithm

# ## Input
# บรรทัดแรก จำนวนสถานี n

# บรรทัดที่สอง ค่าพลังงานของแต่ละสถานี

# ## Output
# ผลรวมพลังงานสูงสุดที่เกิดขึ้นต่อเนื่องกัน

# ## Example

# ### Input
# 7
# 4 -2 5 -1 2 -7 6

# 4 + -2 + 5 + -1 + 2 = 8

# ### Output
# 8
x=int(input())
y=list(map(int, input().split()))

sum = y[0] 
mostsum = y[0] 

for i in range(1,x):
    sum = max(y[i], sum + y[i])
    mostsum = max(mostsum,sum)

print(mostsum)