# # 2. ระบบตรวจจับสายลับ

# เมืองอัจฉริยะมีประชากรเรียงต่อกันเป็นแถว

# แต่ละคนจะมีหมายเลขประจำตัว

# เจ้าหน้าที่สงสัยว่า “สายลับ” จะเป็นคนที่มีหมายเลขปรากฏเพียงครั้งเดียว  
# ในขณะที่คนทั่วไปจะมีหมายเลขซ้ำกัน 2 ครั้งเสมอ

# จงหาหมายเลขของสายลับ

# ## Input
# จำนวนเต็ม n

# หมายเลขประชาชน n ตัว

# ## Output
# หมายเลขของสายลับ

# ## Example

# ### Input
# 7
# 4 1 2 1 2 4 9

# ### Output
# 9

# ---
x=int(input())
y=list(map(int, input().split()))
n = {}

for i in y:
    n[i] = n.get(i, 0) + 1

for i, c in n.items():
    if c == 1:
        print(i)