# # 5. ระบบคัดกรองผู้เล่นเกม

# การแข่งขันเกมออนไลน์ต้องการคัดผู้เล่นที่มีคะแนนเกินเกณฑ์

# หากคะแนนมากกว่าหรือเท่ากับ K ให้ผ่านเข้าสู่รอบต่อไป

# จงหาว่ามีผู้เล่นผ่านทั้งหมดกี่คน

# ## Input
# บรรทัดแรก จำนวนผู้เล่น n และค่า K

# บรรทัดที่สอง คะแนนของผู้เล่นทั้งหมด

# ## Output
# จำนวนผู้เล่นที่ผ่าน

# ## Example

# ### Input
# 5 80
# 75 90 81 60 100

# ### Output
# 3

# ---
x = list(map(int, input().split()))
y = list(map(int, input().split()))
a=1
for i in range(x[0]):
    if y[i] >= x[1]:
        a+=1
print(a)