def min_serve_time(s):  #สร้างฟังก์ชันเพื่อใช้ในการรับค่า S คือ String Layout ของร้าน เช่น "#X#O#X#"
    kitchen = s.index('O') # หาตำแหน่งของครัวใน String Layout โดยเริ่มจากตตัวเจ๊เล็ก คือ 0

        # ฝั่งซ้าย
    left_dist = 0 # สร้างตัวแปรเพื่อใช้ในการเก็บระยะทางที่ไกลที่สุดจากครัวไปยังจุดที่มีอาหารอยู่ในฝั่งซ้าย
    for i in range(kitchen - 1, -1, -1): # วนลูปจากตำแหน่งของครัวไปทางซ้าย
        if s[i] == 'X': # ถ้าพบจุดที่มี X อยู่ให้หยุดการวนลูป เพราะเจ๊เล็กเดินผ่านไม่ได้
            break
        if s[i] == '#': # ถ้าพบจุดที่มีลูกค้า # เริ่มคำนวณระยะทางจาก 0 ไปถึงตำแหน่งนี้
            left_dist = max(left_dist, kitchen - i) # ที่ใช้ Max เพื่อหาค่าระยะทางที่ไกลที่สุดจากครัวไปยังจุดที่มีอาหารอยู่ในฝั่งซ้าย

    # ฝั่งขวา ทำเหมือนกัน
    right_dist = 0
    for i in range(kitchen + 1, len(s)): # วนลูปจากตำแหน่งของครัวไปทางขวา โดย +1 ไปเรื่อยๆ โดยใช้ลูป
        if s[i] == 'X':
            break
        if s[i] == '#':
            right_dist = max(right_dist, i - kitchen)

    return max(left_dist, right_dist) # คืนค่าระยะทางที่ไกลที่สุดจากครัวไปยังจุดที่มีอาหารอยู่ในฝั่งซ้ายและขวา

print(min_serve_time(".#O.#"))         # ตอบ 2
print(min_serve_time("#.XX.#O##"))     # ตอบ 2
print(min_serve_time("#X#O#X#"))       # ตอบ 1
print(min_serve_time("###X#O###X#"))   # ตอบ 3